In [1]:
import numpy as np
import pandas as pd

In [3]:
df=pd.read_csv('weight-height.csv')

In [4]:
df

      Gender     Height      Weight
0       Male  73.847017  241.893563
1       Male  68.781904  162.310473
2       Male  74.110105  212.740856
3       Male  71.730978  220.042470
4       Male  69.881796  206.349801
...      ...        ...         ...
9995  Female  66.172652  136.777454
9996  Female  67.067155  170.867906
9997  Female  63.867992  128.475319
9998  Female  69.034243  163.852461
9999  Female  61.944246  113.649103

[10000 rows x 3 columns]

In [5]:
df.head()

  Gender     Height      Weight
0   Male  73.847017  241.893563
1   Male  68.781904  162.310473
2   Male  74.110105  212.740856
3   Male  71.730978  220.042470
4   Male  69.881796  206.349801

In [7]:
df.keys()

Index(['Gender', 'Height', 'Weight'], dtype='object')

In [9]:
x=df.iloc[:,1:3].values
y=df.iloc[:,0].values

In [12]:
x1=pd.DataFrame(x)

In [13]:
x1

              0           1
0     73.847017  241.893563
1     68.781904  162.310473
2     74.110105  212.740856
3     71.730978  220.042470
4     69.881796  206.349801
...         ...         ...
9995  66.172652  136.777454
9996  67.067155  170.867906
9997  63.867992  128.475319
9998  69.034243  163.852461
9999  61.944246  113.649103

[10000 rows x 2 columns]

In [14]:
x1.head()

           0           1
0  73.847017  241.893563
1  68.781904  162.310473
2  74.110105  212.740856
3  71.730978  220.042470
4  69.881796  206.349801

In [15]:
y1=pd.DataFrame(y)
y1

           0
0       Male
1       Male
2       Male
3       Male
4       Male
...      ...
9995  Female
9996  Female
9997  Female
9998  Female
9999  Female

[10000 rows x 1 columns]

In [16]:
y1.head()

      0
0  Male
1  Male
2  Male
3  Male
4  Male

In [17]:
from sklearn.model_selection import train_test_split
x_train,x_test,y_train,y_test=train_test_split(x1,y1,random_state=0)

In [18]:
x_train

              0           1
2967  68.058837  187.779075
700   69.760095  187.812062
3481  71.702360  214.787698
1621  71.096113  210.821194
800   72.215035  204.937760
...         ...         ...
9225  60.421255   97.263881
4859  66.730755  174.156893
3264  67.467086  162.475957
9845  62.127480  136.783022
2732  70.597025  188.450674

[7500 rows x 2 columns]

In [19]:
y_train

           0
2967    Male
700     Male
3481    Male
1621    Male
800     Male
...      ...
9225  Female
4859    Male
3264    Male
9845  Female
2732    Male

[7500 rows x 1 columns]

In [20]:
x_train.shape

(7500, 2)

In [21]:
x_test.shape

(2500, 2)

In [22]:
y_train.shape

(7500, 1)

In [23]:
y_test.shape

(2500, 1)

In [24]:
from sklearn.neighbors import KNeighborsClassifier
knn=KNeighborsClassifier()

In [25]:
knn.fit(x_train,y_train)

C:\Python\lib\site-packages\sklearn\neighbors\_classification.py:198: DataConversionWarning: A column-vector y was passed when a 1d array was expected. Please change the shape of y to (n_samples,), for example using ravel().
  return self._fit(X, y)

KNeighborsClassifier()

In [26]:
y_pred=knn.predict(x_test)

In [27]:
y_pred

array(['Female', 'Male', 'Male', ..., 'Male', 'Male', 'Female'],
      dtype=object)

In [29]:
x_prediction=np.array([[71.702360,214.787698],[62.127480,136.783022]])

In [32]:
x_prediction

array([[ 71.70236 , 214.787698],
       [ 62.12748 , 136.783022]])

In [33]:
prediction=knn.predict(x_prediction)

In [34]:
prediction

array(['Male', 'Female'], dtype=object)

In [35]:
from sklearn.metrics import accuracy_score, confusion_matrix

In [36]:
score = accuracy_score(y_test, y_pred)
cm = confusion_matrix(y_test, y_pred)

In [37]:
score

0.9016

In [38]:
cm

array([[1122,  115],
       [ 131, 1132]], dtype=int64)